In [1]:
a=10
b=20
c=a+b
c

30

In [ ]:
============================== EDA ==========================
1) Pandas: Data frame applications
2) Numpy: Numerical python All math applications
3) Matplotlib: used for plotting
4) Seaborn: used for plot
5) plotly: use for plot
6) Bokhe: plot
================================ Machine learning ==============
7) Sickit-learn: sklearn
================================ Deep learning =================
8) Tensorflow: Google
9) Keras: Google
10) Pytorch: Facebook
================================== NLP ========================
11) NLTK: Natural language tool kit
12) Scipy
==================================== BERT ======================
13) Transformers: Hugging face(Google)
============================== Google models =================
14) Specific Google packages
============================== Azure ML =================
15) Azure packages
============================== GenAI ================
16) Geminiai: Google
17) ChatGPT: OpenAI
============================ LangChain ==================
18) LangChain Packages

**Create a dataframe using list**

In [ ]:
- list==== dictionary
- dictionary===list

$Step-1:$
**create a dataframe**

In [1]:
import pandas as pd
names=['Ayush','Avinash','Akash']
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

$step-2:$
**Provide the data**

In [2]:
names=['Ayush','Avinash','Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [3]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age))
# what is the first positional argument: data
# second positional argument: index

         0   1
0    Ayush  25
1  Avinash  30
2    Akash  35

In [4]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age)
pd.DataFrame(data,city)

               0   1
hyd        Ayush  25
blr      Avinash  30
chennai    Akash  35

$step-3:$
**Provide the column names**

In [5]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age),columns=['Names','Age'])

     Names  Age
0    Ayush   25
1  Avinash   30
2    Akash   35

In [8]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age,city)
cols=['Names','Age','City']
pd.DataFrame(data,columns=cols)

     Names  Age     City
0    Ayush   25      hyd
1  Avinash   30      blr
2    Akash   35  chennai

In [9]:
df=pd.DataFrame(data,columns=cols)
type(df)

pandas.core.frame.DataFrame

$Step-4:$
**Add new column**

In [ ]:
- If you want to add new column
- first you need to check the number of rows in already

In [12]:
job=['DS','DE','CS']
df['JOB']=job
df

  Names  Age City JOB
0   NaN  NaN  NaN  DS
1   NaN  NaN  NaN  DE
2   NaN  NaN  NaN  CS

In [15]:
import pandas as pd
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,columns=cols)

In [16]:
job=['DS','DE','CS']
df['JOB']=job
df

     Names  Age     City JOB
0    Ayush   25      hyd  DS
1  Avinash   30      blr  DE
2    Akash   35  chennai  CS

$step-5$
**Update the already existed column**

$step-6$ 
**Change index**

In [17]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','Mumbai']
data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

**Note**

- Number of list equals to **Number of columns**
- Number of values inside list equals to **Number of rows**
- when you create the data all the lists will be

$Step-7$

**shape**

- Number of rows
- Nuber of columns

In [19]:
df.shape
# matrix format
# 4 rows and 3 columns
print("the number of rows are:",df.shape[0])
print("the number of columns are:",df.shape[1])

the number of rows are: 4
the number of columns are: 3

$Step-8$

**Drop the column**

- In order to drop column we require 3 arguments
- Column name
      - The column name we need to mention
- axis
    - axis=0 **represents rows**
    - axis=1 **represents columns**
- inplace
    - we are drop column means we are modifying the data frame
    - so this modifications we want to save in same variable or different variable
    - if you want to keep in the same variable the **inplace=True**

In [20]:
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [21]:
df.drop('City',axis=1,inplace=True)
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [22]:
df1=df.drop('Age',axis=1) 
df1

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [23]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','Mumbai']
data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [24]:
df.drop('City',axis=1,inplace=True)
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

$Step-9$

**Multiple columns drop**

In [25]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','Mumbai']
data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [26]:
df.drop(['Age','City'],axis=1,inplace=True)
df

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

$Step-10$

**Drop the rows**

In [27]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','Mumbai']
data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [28]:
df.drop('A',axis=0,inplace=True)
df

     Names  Age     City
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

$Step-11$

**How to save the data frame**

- Generally data frames are two types
- csv (comma separated value)
- excel

In [30]:
# file name=data
# extension=.csv
df.to_csv('data.csv')
df.to_csv('data1.csv',index=False)

In [31]:
# Extension
#.xlsx
df.to_excel('data2.xlsx',index=False)